app/controllers/days_controller.rb

SELECT * FROM "days"
---
  def index
    @days = Day.all

INSERT INTO "days" ("total_tips", "tipout_pct", "created_at", "updated_at", "person_id", "when") VALUES(NULL, NULL, '2010-06-12 19:06:07', '2010-06-12 19:06:07', NULL, '2010-06-11')
SELECT * FROM "days" WHERE ("days"."when" = '2010-06-23') LIMIT 1
SELECT * FROM "shifts" WHERE ("shifts".person_id = 6 AND ("shifts"."day_id" = 59)) LIMIT 1
INSERT INTO "shifts" ("created_at", "updated_at", "second_floor", "time_in", "person_id", "closing_barback", "time_out", "day_id") VALUES('2010-06-13 03:09:28', '2010-06-13 03:09:28', NULL, NULL, 1, NULL, NULL, 10)
UPDATE "shifts" SET "updated_at" = '2010-06-26 05:39:07', "time_in" = '2010-06-27 00:00:00', "time_out" = '2010-06-27 08:00:00' WHERE "id" = 200
---
  def create

    @day = Day.new :person_ids => params[:person_ids]
    @day.when = (Date.today - 1) unless (@day.when)
    @day.save
    @day.shifts.each do |s|
      s.time_in = "7:00 PM" unless (s.time_in)
      s.time_out ="3:00 AM" unless (s.time_out)
      s.save

SELECT * FROM "days" WHERE ("days"."id" = 2)
---
  def show
    @day = Day.find(params[:id])

SELECT * FROM "days" WHERE ("days"."id" = 1)
---
  def edit
    @day = Day.find(params[:id])

SELECT * FROM "days" WHERE ("days"."id" = 15)
UPDATE "days" SET "updated_at" = '2010-06-26 07:46:06', "tipout_pct" = 5, "total_tips" = 1000, "when" = '2010-06-25' WHERE "id" = 70
---
  def update
    @day = Day.find(params[:id])

    if @day.update_attributes(params[:day])

SELECT * FROM "days" WHERE ("days"."id" = 37)
DELETE FROM "days" WHERE "id" = 37
---
  def destroy
    @day = Day.find(params[:id])
    @day.destroy